GM4AJK/gps-staff/firmware/esp32-handheld/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# CPU / flash / PSRAM
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_SPEED_80M=y

# Console via CH343P UART (not USB Serial/JTAG)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# FreeRTOS / cache
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# LVGL task on core 1, tear-avoidance mode 3 (double-buf + direct), portrait 90°
CONFIG_EXAMPLE_LVGL_PORT_TASK_CORE=1
CONFIG_EXAMPLE_LVGL_PORT_AVOID_TEAR_ENABLE=y
CONFIG_EXAMPLE_LVGL_PORT_AVOID_TEAR_MODE_3=y
CONFIG_EXAMPLE_LVGL_PORT_ROTATION_270=y

# Partition table — 3MB app partition (default 1MB too small once WiFi is added)
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# BLE (NimBLE) — local WiFi removed, HH is BLE-only for provisioning
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=512

# LVGL fonts
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_32=y
